app/Controllers/usuariocontroller.php

INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `pass`) VALUES ('sofia', 'cubilla', 'Sofia', 'sofi123@gmail.com', '$2y$10$CB22OXhmYLUwXH5frji/Mennu/XO7cHKAQTOgmVho/c2mKUtyhnO.')
---
    public function formValidation() {

        $input = $this->validate([
            'nombre' => 'required|min_length[3]',
            'apellido' => 'required|min_length[3]|max_length[25]',
            'usuario' => 'required|min_length[3]',
            'email' => 'required|min_length[4]|max_length[100]|valid_email|is_unique[usuarios.email]',
            'pass' => 'required|min_length[3]|max_length[10]'
        ],

    );
    $formModel = new usuariomodel();

    if(!$input){
        $data['titulo']='Registro';
        echo view('front/headview', $data);
        echo view('front/navbarview');
        echo view('back/usuario/registro', ['validation' => $this->validator]);
        echo view('front/footerview');
    }else{
        $formModel->save([
            'nombre' => $this->request->getVar('nombre'),
            'apellido' => $this->request->getVar('apellido'),
            'usuario' => $this->request->getVar('usuario'),
            'email' => $this->request->getVar('email'),
            'pass' => password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT)
        ]);